In [16]:
import pandas as pd

In [17]:
df = pd.DataFrame({
    'nome': ['Alice', 'Bob', 'Charlie', 'David', 'Alice', 'Alice'],
    'sobrenome': ['Smith', 'Jones', 'Brown', 'Calvo', 'Smith', 'Smith'],
    'salario': [70000, 80000, 90000, 60000, 70000, 75000]  
})

In [18]:
df

      nome sobrenome  salario
0    Alice     Smith    70000
1      Bob     Jones    80000
2  Charlie     Brown    90000
3    David     Calvo    60000
4    Alice     Smith    70000
5    Alice     Smith    75000

In [19]:
# Remover duplicatas com base na coluna 'nome e sobrenome'
df.drop_duplicates()

      nome sobrenome  salario
0    Alice     Smith    70000
1      Bob     Jones    80000
2  Charlie     Brown    90000
3    David     Calvo    60000
5    Alice     Smith    75000

In [20]:
# Remover duplicatas, mantendo a última ocorrência
df.drop_duplicates(keep='last')

      nome sobrenome  salario
1      Bob     Jones    80000
2  Charlie     Brown    90000
3    David     Calvo    60000
4    Alice     Smith    70000
5    Alice     Smith    75000

In [24]:
# Remover duplicatas com base em múltiplas colunas, sem ela não haveria mudança pois o salario é diferente
df = df.sort_values('salario', ascending=False)
df.drop_duplicates(keep='last', subset=['nome', 'sobrenome'])

      nome sobrenome  salario
2  Charlie     Brown    90000
1      Bob     Jones    80000
4    Alice     Smith    70000
3    David     Calvo    60000